from OnLab.preprocessor import Preprocessor


def test_preprocess():
    # Arrange
    pr = Preprocessor()
    text = '''
{
    "stages_params": {
        "нанесениефоторезиста": {
            "main": [
                {"name": "Толщина слоя фоторезиста", "unit": "мкм", "output_value": "1-2", "description": "Средняя толщина нанесенного слоя"},
                {"name": "Равномерность покрытия", "unit": "%", "output_value": ">95%", "description": "Однородность распределения фоторезиста"}
            ],
            "control": [
                {"name": "Температура нанесения", "unit": "°C", "input_value": "20±2", "description": "Оптимальная температура помещения"},
                {"name": "Скорость вращения подложки", "unit": "об/мин", "input_value": "3000-5000", "description": "Частота вращения центрифуги"}
            ],
            "input": [],
            "resource": [
                {"name": "Тип фоторезиста", 
                 "unit": "-",
                 "expected_value": "Позитивный/негативный",
                 "result": "Неравномерное покрытие",
                 "condition": "=",
                 "description": "Выбор типа фоточувствительного материала"
                },
                {"name": "Срок годности фоторезиста", 
                 "unit": "месяцы",
                 "expected_value": "<12",
                 "result": "Потеря чувствительности",
                 "condition": "<=",
                 "description": "Сохранность свойств фоторезиста"
                }
            ]
        },
        "засвечиваниечерезфотошаблон": {
            "main": [
                {"name": "Разрешение узора", "unit": "μm", "output_value": "≤1", "description": "Минимальное разрешение проявленного рисунка"},
                {"name": "Контрастность изображения", "unit": "-", "output_value": "≥10", "description": "Отчетливость границ элементов"}
            ],
            "control": [
                {"name": "Мощность источника света", "unit": "Вт", "input_value": "500-1000", "description": "Интенсивность УФ-излучения"},
                {"name": "Время экспозиции", "unit": "сек.", "input_value": "30-60", "description": "Продолжительность засветки"}
            ],
            "input": [
                {"name": "Шаблон", "unit": "-", "input_value": "Хромовый", "description": "Материал шаблона"}
            ],
            "resource": []
        },
        "проявление": {
            "main": [
                {"name": "Чистота поверхности после проявления", "unit": "%", "output_value": "≥99%", "description": "Качество удаления незасвеченных участков"},
                {"name": "Точность размеров элементов", "unit": "μm", "output_value": "±0.1", "description": "Отклонение от заданных размеров"}
            ],
            "control": [
                {"name": "Концентрация проявителя", "unit": "%", "input_value": "1-3", "description": "Активность раствора проявителя"},
                {"name": "Температура проявляющего раствора", "unit": "°C", "input_value": "20±2", "description": "Оптимальная температура процесса"}
            ],
            "input": [],
            "resource": [
                {"name": "Проявляющий раствор", 
                 "unit": "-",
                 "expected_value": "Щелочной",
                 "result": "Некачественное проявление",
                 "condition": "=",
                 "description": "Химический состав проявляющей жидкости"
                }
            ]
        },
        "использованиедлятравленияинапыления": {
            "main": [
                {"name": "Глубина травления", "unit": "мкм", "output_value": "1-5", "description": "Максимально достижимая глубина травления"},
                {"name": "Адгезия напылённого слоя", "unit": "-", "output_value": "Высокая", "description": "Прочность сцепления наносимого материала"}
            ],
            "control": [
                {"name": "Режим обработки", "unit": "-", "input_value": "Ионно-плазменная обработка", "description": "Метод травления или напыления"}
            ],
            "input": [],
            "resource": []
        }
    }
}
'''

    # Act
    res = pr.preprocess(text)

    # Assert
    assert len(res) > 0

